vinhdn/esp32s3-gemini/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# PSRAM la bat buoc: buffer ghi am WAV (~256KB) va cac buffer text/audio nam
# trong PSRAM. Luu y mbedtls KHONG dung duoc PSRAM - do la ly do kien truc
# phai tranh moi ket noi TLS chay dai (xem main/assistant/assistant_config.h).
# Da xac nhan qua esptool chip-detect: "Embedded PSRAM 8MB (AP_3v3)" tren
# ESP32-S3 (QFN56 rev v0.2) = bien the R8 voi PSRAM Octal trong package, KHONG
# phai Quad. Dat sai Quad/Octal gay treo/reset ngay tu rat som luc boot.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash size - TODO: doi theo module that (4MB/8MB/16MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# TLS cho HTTPS POST toi api.groq.com (STT + LLM). Buoc TTS dung HTTP thuan
# nen khong lien quan tot ca cac option duoi day.
# TLS 1.3 TAT: gap MBEDTLS_ERR_SSL_ALLOC_FAILED tren board that (RAM noi bo
# chi con vai chuc KB sau khi WiFi+audio+LVGL da khoi tao, va bi phan manh).
# TLS 1.3 trong mbedtls can them cau truc/bo nho cho session ticket + key
# schedule, nang hon dang ke so voi TLS 1.2 — Groq van ho tro day du TLS 1.2
# nen tat 1.3 de giam ap luc bo nho luc handshake.
# CONFIG_MBEDTLS_SSL_PROTO_TLS1_3 is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Dung bundle rut gon (~99% coverage, giam 50% kich thuoc) thay vi full ~200
# CA, cung de bot ap luc bo nho/flash — root cua Google chac chan nam trong
# tap rut gon nay (Groq dung chung chi cua Let's Encrypt/Cloudflare, cung nam
# trong tap rut gon).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# Da gap MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x7F00) that tren board that: mbedtls
# khong xin duoc du RAM noi bo de dung buffer SSL co dinh (16KB in / 4KB out)
# khi WiFi+LVGL+audio dang chiem nhieu heap cung luc. Bat buffer SSL co kich
# thuoc dong (co the giam dan ve dung luong that dung) de giam RAM can cho
# moi ket noi TLS. (MBEDTLS_DYNAMIC_BUFFER la lua chon khac cung muc dich
# nhung loai tru lan nhau voi option nay - khong dung ca 2.)
CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH=y

# Stack lon hon cho cac task xu ly JSON/HTTP/audio
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# LVGL qua managed component - dung mac dinh cua esp_lvgl_port

# Log level mac dinh, bat verbose khi debug provisioning/tro ly
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Bat WiFi AP+STA dong thoi khong bat buoc (chi can khi provisioning), giu mac dinh IDF.

# BLE (NimBLE - nhe hon Bluedroid ve RAM) cho tinh nang "Car Mode" hien thi
# toc do. Chi 1 trong 2 (WiFi hoac BLE) chay tai 1 thoi diem — xem
# main/ble/ble_car_service.c va app_main.c (chuyen mode qua giu nut Talk).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# --- Giam nhiet / Power management ---
# Cho phep CPU xuong 80MHz khi idle (khong co task nao can xu ly)
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# Giam FreeRTOS tick rate tu 1000 xuong 100 (it timer interrupt hon)
CONFIG_FREERTOS_HZ=100
